# Задача 1
# Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.

for i in range(1,6):
    print('{} - 00000000000000000000000000000000000000000000000000000000000000000000000000000000'.format(i))
