#Задача 5
#Вывести цифры числа на каждой строчке.

integer_number = 2129
for i in range(len(str(integer_number))):
    print(str(integer_number)[i])