#Задача 3
#Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
s = 0
for i in range(1,101):
    s += i
print(s)